tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "nikitabobko/tap"

# CLI Tools
brew "atuin"
brew "awscli"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "zoxide"

# Window Management & Desktop
brew "dimentium/autoraise/autoraise"
brew "felixkratz/formulae/borders"
cask "nikitabobko/tap/aerospace"

# Apps
cask "bettertouchtool"
cask "chatgpt"
cask "claude"
cask "docker-desktop"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "jordanbaird-ice"
cask "logi-options+"
cask "obsidian"
cask "pocket-casts"
cask "visual-studio-code"
